In [1]:
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import psycopg2
import pandas as pd
import time

In [2]:
# Set up SQL server and insert tables

In [3]:
# Database and connection specifics
username = 'postgres'
password = 'samsam'
host     = 'localhost'
port     = '5432'
db_name  = 'cities_db'

In [4]:
# Create an engine, or a connection to a database
engine = create_engine( 'postgresql://{}:{}@{}:{}/{}'.format(username, password, host, port, db_name) )
print(engine.url)

postgresql://postgres:samsam@localhost:5432/cities_db

In [5]:
# Create the database if it doesn't exist already
if not database_exists(engine.url):
    create_database(engine.url)
print(database_exists(engine.url))

True

In [6]:
# Read .csv into pandas dataframe
cities = pd.read_csv('cities_text_processed_df.csv', index_col = 0 )
cosims_stacked = pd.read_csv('data/cos_sims_stacked.csv', index_col=[0,1], header = None)

/home/sam/anaconda3/envs/insight/lib/python3.7/site-packages/numpy/lib/arraysetops.py:518: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  mask |= (ar1 == a)

In [7]:
# # Insert my data tables into SQL database 
# # 1.5 hours
# start = time.time()
# cities.to_sql('cities_table', engine, if_exists='replace')
# end = time.time()
# print(end - start)

In [8]:
# start = time.time()
# cosims_stacked.to_sql('cosims_stacked_table', engine, if_exists='replace')
# end = time.time()
# print(end - start)

In [9]:
# print('Insert finished')

In [10]:
# Reading from SQL server

In [12]:
# Read and insert narrow cities dataframe
cities_narrow = pd.read_csv('cities_narrow.csv', index_col = 0)
cities_narrow.to_sql('cities_narrow', engine, if_exists='replace')

In [ ]:
# Read from SQL server

In [13]:
con = None
con = psycopg2.connect(database = db_name, user = username, password = password, host = host , port = port)

In [14]:
sql_query = """
SELECT * FROM cities_narrow;
"""

In [21]:
cities_narrow = pd.read_sql_query(sql_query,con, index_col = None)
cities_narrow.drop(['index'],axis=1,inplace=True)
cities_narrow.head()

,Country,City,Lat,Lon,s1,s2,s3,s4,s5,s6,s7,s8,s9,s10
0,Afghanistan,Herat,34.340000,62.189999,1209,2624,1201,2210,599,1219,1055,962,1754,1232
1,Afghanistan,Kabul,34.516667,69.183334,233,1744,1742,1628,2607,2310,1746,885,2362,2015
2,Afghanistan,Jalalabad,34.420000,70.449997,1062,2637,995,1754,1,1193,1072,1099,991,1211
3,Afghanistan,Kandahar,31.610000,65.699997,2000,1741,1220,1037,1980,929,2628,1133,1111,1002
4,Afghanistan,Kunduz,36.720000,68.860001,0,1776,1777,1778,1779,1780,1781,1782,1783,1784

In [23]:
# Get index table
idx = cities_narrow.loc[:,'s1':'s10']
idx.head()

     s1    s2    s3    s4    s5    s6    s7    s8    s9   s10
0  1209  2624  1201  2210   599  1219  1055   962  1754  1232
1   233  1744  1742  1628  2607  2310  1746   885  2362  2015
2  1062  2637   995  1754     1  1193  1072  1099   991  1211
3  2000  1741  1220  1037  1980   929  2628  1133  1111  1002
4     0  1776  1777  1778  1779  1780  1781  1782  1783  1784

In [25]:
cities_narrow.iloc[idx.iloc[2133]]

,Country,City,Lat,Lon,s1,s2,s3,s4,s5,s6,s7,s8,s9,s10
1934,Russia,Novosibirsk,55.041111,82.934441,1940,1918,2133,1979,1957,52,2256,1628,1515,1981
1511,Kyrgyzstan,Bishkek,42.873056,74.600278,2133,1223,1212,735,736,885,2222,733,52,1918
1223,Iraq,Sulaimaniya,35.561667,45.440834,2222,1212,1530,1190,2235,2133,1511,1185,532,1199
52,Armenia,Yerevan,40.181111,44.513611,1918,1523,2008,1515,885,1628,2577,735,736,2250
847,Germany,Stuttgart,48.782324,9.177017,736,735,808,2310,800,828,885,2562,2015,1724
2250,Ukraine,Kyiv,50.433333,30.516666,1918,1523,2008,800,885,2015,847,1957,52,1515
1212,Iran,Tabriz,38.080000,46.291943,1223,2222,1530,1209,1190,1211,1187,1511,962,1055
885,Hungary,Budapest,47.500000,19.083334,735,736,822,233,1725,800,102,669,2015,2008
1452,Kazakhstan,Shymkent,42.300000,69.599998,2133,1742,847,735,736,1447,344,2320,1702,885
1628,Mongolia,Ulaanbaatar,47.916667,106.916667,233,1850,2624,885,2017,1979,1918,2015,2202,2008

In [ ]:
# Connect to make queries using psycopg2
con = None
con = psycopg2.connect(database = db_name, user = username, password = password, host = host , port = port)

In [ ]:
# query:
sql_query = """
SELECT * FROM cities_table;
"""

In [ ]:
cities_df = pd.read_sql_query(sql_query,con, index_col = 'index')
cities_df.head()
cities_df.sort_index(inplace=True) #Reorder by index as SQL alters order

In [ ]:
cities_df = cities_df.reset_index()
cities_df.drop(['index'], axis=1, inplace=True)

In [ ]:
# query:
sql_query = """
SELECT * FROM cosims_stacked_table;
"""

In [ ]:
cosims_stacked_df = pd.read_sql_query(sql_query,con, index_col = ['0','1'])
cosims_df = cosims_stacked_df.unstack()

In [ ]:
cosims_df.head()